# GetLinkTransform Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceDetailNode..::..GetLinkTransform Method
FaceDetailNode Class See Also
---
Returns link transform of the object being drawn.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public Transform GetLinkTransform()
```

Visual Basic
---
```text
Public Function GetLinkTransform As Transform
```

Visual C++
---
```text
public:
Transform^ GetLinkTransform()
```

# See Also
FaceDetailNode Class
Autodesk.Revit.DB Namespace